app/services/conversation_logger.rb

  def self.clear_logs
    begin
      count = Conversation.count
---
SELECT COUNT(*) FROM "conversations"

  def self.conversation_count
    Conversation.count
---
SELECT COUNT(*) FROM "conversations"