app/services/ollama_service.rb

  def chat(user_message, conversation_context = [], character_id = nil)
    # Ensure Ollama is running
    unless ollama_running?
      raise "Ollama is not running. Please start Ollama first."
    end

    # Ensure model is available
    unless model_available?
      pull_model
    end

    # Get character personality if specified
    character = nil
    if character_id.present?
      character = Character.active.find_by(id: character_id)
---
SELECT "characters".* FROM "characters" WHERE "characters"."active" = ? AND "characters"."id" = ? LIMIT ?  [["active", 1], ["id", 8], ["LIMIT", 1]]