app/views/chat/index.html.erb

      activeEmoji.textContent = this.selectedCharacter.emoji;
      activeName.textContent = this.selectedCharacter.name;
---
SELECT "characters".* FROM "characters" WHERE "characters"."active" = ? ORDER BY "characters"."name" ASC  [["active", 1]]