app/controllers/chat_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."active" = ? ORDER BY "characters"."name" ASC  [["active", 1]]
---
  def index
    # Main chat interface
    @characters = Character.active.order(:name)

SELECT "conversations".* FROM "conversations" WHERE "conversations"."session_id" = ? ORDER BY "conversations"."created_at" DESC LIMIT ?  [["session_id", "20250927_10"], ["LIMIT", 10]]
SELECT "characters".* FROM "characters" WHERE "characters"."active" = ? AND "characters"."id" = ? LIMIT ?  [["active", 1], ["id", 8], ["LIMIT", 1]]
---
  def send_message
    user_message = params[:message]
    session_id = params[:session_id] || generate_session_id
    character_id = params[:character_id]

    if user_message.blank?
      render json: { error: 'Message cannot be empty' }, status: 400
      return
    end

    begin
      # Get recent conversation context for this session (last 10 messages)
      conversation_context = ConversationLogger.conversations_by_session(session_id)
                                               .limit(10)
                                               .map { |conv|
                                                 {
                                                   user_message: conv.user_message,
                                                   ai_response: conv.ai_response
                                                 }
                                               }

      # Send message to Ollama with conversation context and character
      response = OllamaService.new.chat(user_message, conversation_context, character_id)

      # Log the conversation with session ID
      ConversationLogger.log(user_message, response, session_id)

      # Get character info for voice settings
      character = Character.active.find_by(id: character_id) if character_id.present?

SELECT COUNT(*) FROM "conversations"
---
  def history
    # Load conversations directly for template rendering
    begin
      @conversations = Conversation.recent_conversations(limit: 50)
      @total_count = Conversation.count