app/controllers/settings_controller.rb

SELECT "prompt_configs".* FROM "prompt_configs" WHERE "prompt_configs"."key" = ? LIMIT ?  [["key", "encouragement_level"], ["LIMIT", 1]]
UPDATE "prompt_configs" SET "value" = ?, "updated_at" = ? WHERE "prompt_configs"."id" = ?  [["value", "low"], ["updated_at", "2025-09-26 15:45:02.202632"], ["id", 2]]
---
  def update
    begin
      config_params.each do |key, value|
        next if key.blank? || value.nil?

        # Find the existing config to get its type and description
        existing_config = PromptConfig.find_by(key: key)
        if existing_config
          existing_config.update!(value: value.to_s.strip)