app/models/prompt_config.rb

SELECT "prompt_configs".* FROM "prompt_configs" WHERE "prompt_configs"."key" = ? LIMIT ?  [["key", "dad_name"], ["LIMIT", 1]]
---
  def self.seed_default_configs
    defaults = [
      # Family Information
      { key: 'dad_name', value: '', config_type: FAMILY_INFO, description: 'Father\'s name' },
      { key: 'mom_name', value: '', config_type: FAMILY_INFO, description: 'Mother\'s name' },
      { key: 'child_name', value: '', config_type: FAMILY_INFO, description: 'Child\'s name' },
      { key: 'child_age', value: '', config_type: FAMILY_INFO, description: 'Child\'s age' },
      { key: 'other_family', value: '', config_type: FAMILY_INFO, description: 'Other family members (siblings, grandparents, etc.)' },
      { key: 'child_interests', value: '', config_type: FAMILY_INFO, description: 'Child\'s interests and hobbies' },
      { key: 'family_rules', value: '', config_type: FAMILY_INFO, description: 'Important family rules to remember' },
      { key: 'special_instructions', value: '', config_type: FAMILY_INFO, description: 'Any special instructions for Cally' },

      # Behavioral Settings
      { key: 'response_style', value: 'friendly and encouraging', config_type: BEHAVIORAL, description: 'How Cally should respond (friendly, enthusiastic, calm, etc.)' },
      { key: 'encouragement_level', value: 'high', config_type: BEHAVIORAL, description: 'How much encouragement to give (low, medium, high)' },
      { key: 'explanation_detail', value: 'simple', config_type: BEHAVIORAL, description: 'Level of detail in explanations (simple, detailed, very simple)' },

      # Safety Overrides
      { key: 'additional_safety_rule_1', value: '', config_type: SAFETY, description: 'Custom safety rule 1' },
      { key: 'additional_safety_rule_2', value: '', config_type: SAFETY, description: 'Custom safety rule 2' },

      # Personalization
      { key: 'greeting_style', value: 'Hi there!', config_type: PERSONALIZATION, description: 'How Cally greets the child' },
      { key: 'favorite_emoji', value: '🤖', config_type: PERSONALIZATION, description: 'Cally\'s favorite emoji to use' }
    ]

    defaults.each do |config|
      find_or_create_by(key: config[:key]) do |c|
        c.value = config[:value]